---
kind: property
id: P:Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfectionsAmount
source: html/ecfb176e-01e5-5ce8-b837-d1fba94918b1.htm
---
# Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfectionsAmount Property

The property labeled "Amount" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public static string HardwoodImperfectionsAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "-10, 10".